---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LinkFailures.ModifyingLinkedFile
source: html/b01b729f-a4bd-0612-2080-b4559052cf53.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LinkFailures.ModifyingLinkedFile Property

Shared Locations in the Linked Model '[Name]' have been modified, but not saved back to the Linked File.
 Upon reopening, instances of the Linked Model will return to their last Saved Positions.
 You can Save the Linked Model later via the Manage Links dialog.

## Syntax (C#)
```csharp
public static FailureDefinitionId ModifyingLinkedFile { get; }
```